SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict ztipcwhhVoknMkTUikEXwYckAaHTAHi2Om1UKYgbf8mjRcc4lgzpITnKAuL9sCv

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: data_tbl_shop; Type: TABLE DATA; Schema: data; Owner: -
--

INSERT INTO "data"."data_tbl_shop" ("id", "name", "type") VALUES
	(1, '出云村防具店', 1),
	(2, '出云村药店', 1),
	(3, '出云村武器店', 1),
	(4, '出云村杂货店', 1),
	(6, '道具商人2', 1),
	(19, '东玄城药店', 1),
	(20, '精灵城药店', 1),
	(21, '食品店', 1),
	(22, '撩云技能书店', 1),
	(23, '东玄城防具店', 1),
	(25, '东玄城武器店', 1),
	(27, '东玄城首饰店', 1),
	(28, '精灵城首饰店', 1),
	(32, '东玄城杂货店', 1),
	(33, '灵舞技能书店', 1),
	(34, '磐地技能书店', 1),
	(35, '商城卷轴', 1),
	(36, '商城宝石', 1),
	(41, '商城美食', 1),
	(43, '东玄城宠物店', 1),
	(44, '精灵城宠物店', 1),
	(45, '出云村宠物店', 1),
	(47, '仙朵拉城防具店', 1),
	(48, '精灵城防具店', 1),
	(49, '庞贝城防具店', 1),
	(50, '仙朵拉城武器店', 1),
	(51, '精灵城武器店', 1),
	(52, '庞贝城武器店', 1),
	(53, '仙朵拉城首饰店', 1),
	(54, '精灵城首饰店', 1),
	(55, '庞贝城首饰店', 1),
	(56, '天曙技能书店', 1),
	(57, '天穹技能书店', 1),
	(58, '庞贝城药店', 1),
	(59, '仙朵拉城药店', 1),
	(60, '仙朵拉城杂货店', 1),
	(61, '庞贝城杂货店', 1),
	(62, '庞贝城宠物店', 1),
	(63, '仙朵拉城宠物店', 1),
	(64, '精灵城杂货店', 1),
	(65, '商城宝物', 1),
	(66, '商城材料', 1),
	(67, '商城宠物', 1),
	(68, '任务道具商店', 1),
	(69, '流火技能书店', 1),
	(11, '情人节活动积分商店', 2),
	(7, '道具商人3', 1),
	(8, '道具商人4', 1),
	(9, '道具商人5', 1),
	(10, '道具商人6', 1),
	(5, '道具商人1', 1),
	(70, '商城积分', 1),
	(73, '眷顾城药店', 1),
	(74, '眷顾城武器店', 1),
	(75, '眷顾防具店', 1),
	(76, '眷顾杂货店', 1),
	(77, '眷顾宠物店', 1),
	(78, '眷顾食品店', 1),
	(79, '迷宫商城', 1),
	(80, '作弊考官', 1),
	(81, '商城书店', 1),
	(82, '采集道具商店', 1),
	(83, '公会商店', 2),
	(84, '生活图样商店', 1),
	(85, '角斗场商店', 2),
	(71, '圣诞活动积分商店', 2),
	(72, '元旦活动积分商店', 2),
	(12, '婚庆用品商人', 1),
	(13, '春节活动积分商店', 2),
	(14, '元宵节活动积分商店', 2),
	(15, '劳动节活动积分商店', 2),
	(86, '复活节商店', 1),
	(87, '翅膀商店', 1),
	(88, '商城时装', 1),
	(89, '商城飞行器', 1),
	(90, '钓鱼大赛商店', 2),
	(91, '七夕节商店', 2),
	(16, '暑期活动积分商店', 2),
	(92, '双十一商店', 2),
	(93, '跨服宠物竞技商店', 2),
	(94, '感恩节商店', 1),
	(95, '春节喜庆物品商店', 1),
	(96, '小精灵商店', 1),
	(97, '端午节商店', 1),
	(98, '斗宠积分商店', 2),
	(99, '钻石商店', 1),
	(101, '暑期活动积分商店', 2),
	(102, '迷阵商城', 1),
	(103, '国庆节商店', 2),
	(104, '神秘商店', 1),
	(105, '国庆节商店', 2),
	(106, '宠物兑换商店', 2),
	(107, '巴西世界杯兑换商店', 2),
	(108, '巴西世界杯兑换商店', 2),
	(109, '金子商店', 1),
	(110, '行空商人', 1),
	(111, '劳动节积分商店', 2),
	(112, '周年庆商店', 2),
	(113, '周年消费商店', 2),
	(114, '魔力召回商店', 2),
	(115, '宠物PK商店', 2),
	(116, '魔力之星活动商店', 2),
	(117, '中元节活动商店', 1),
	(118, '中秋活动商店', 1),
	(119, '国庆活动商店', 2),
	(120, '万圣节幸运商店', 1),
	(121, '元旦商店', 2),
	(122, '2020春节商店', 2),
	(123, '2020魔力新宠商店', 1),
	(124, '白色情人节商店', 1),
	(125, '六一幸运商店', 2),
	(126, '2020魔力之星商店', 2),
	(127, '消除大赛积分商店', 2),
	(128, '消费惊喜礼包商店', 2),
	(129, '21端午商店', 1),
	(130, '魔力扭蛋机商店', 1),
	(131, '跨年幸运商店', 2),
	(132, '消费惊喜礼包商店', 2),
	(133, '魔力之星活动商店', 2),
	(134, '大漠宝库商店', 2),
	(135, '游园会商店', 2);


--
-- PostgreSQL database dump complete
--

-- \unrestrict ztipcwhhVoknMkTUikEXwYckAaHTAHi2Om1UKYgbf8mjRcc4lgzpITnKAuL9sCv


SET session_replication_role = origin;
