SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict aptBzESYUt186IXflJZiktvwkhJKVtWo2dPXfWDHuRU56ektiaG0bAiFV5i8IWi

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: data_tbl_awakening; Type: TABLE DATA; Schema: data; Owner: -
--

INSERT INTO "data"."data_tbl_awakening" ("id", "item_num", "money", "name", "points", "prop1", "prop2", "prop_num1", "prop_num2", "rate", "req_level") VALUES
	(1, 10, 280000, 'Thính Giác (Chưa K.Hoạt 1)', 0, 1, -1, 1959.0000, 0.0000, 100, 80),
	(2, 10, 420000, 'Thính Giác (Chưa K.Hoạt 2)', 0, 4, 5, 490.0000, 392.0000, 90, 80),
	(3, 10, 560000, 'Thính Giác (Chưa K.Hoạt 3)', 0, 11, -1, 196.0000, 0.0000, 80, 80),
	(4, 14, 700000, 'Thính Giác (Chưa K.Hoạt 4)', 0, 62, 63, 0.0048, 0.0048, 70, 80),
	(5, 14, 840000, 'Thính Giác (Chưa K.Hoạt 5)', 0, 1, -1, 2939.0000, 0.0000, 60, 80),
	(6, 14, 980000, 'Thính Giác (Chưa K.Hoạt 6)', 0, 4, 5, 735.0000, 588.0000, 55, 80),
	(7, 14, 1120000, 'Thính Giác (Chưa K.Hoạt 7)', 0, 11, -1, 294.0000, 0.0000, 50, 80),
	(8, 20, 1260000, 'Thính Giác (Chưa K.Hoạt 8)', 0, 62, 63, 0.0072, 0.0072, 45, 80),
	(9, 22, 1400000, 'Thính Giác (Chưa K.Hoạt 9)', 0, 13, -1, 0.9800, 0.0000, 40, 80),
	(10, 22, 1540000, 'Thính Giác (Chưa K.Hoạt 10)', 0, 31, -1, 0.9800, 0.0000, 35, 80),
	(11, 22, 1680000, 'Thính Giác (Đã K.Hoạt)', 1, 34, -1, 0.9800, 0.0000, 30, 80),
	(12, 14, 420000, 'Vị Giác (Chưa K.Hoạt 1)', 0, 1, -1, 2449.0000, 0.0000, 90, 90),
	(13, 14, 630000, 'Vị Giác (Chưa K.Hoạt 2)', 0, 4, 5, 612.0000, 490.0000, 80, 90),
	(14, 14, 840000, 'Vị Giác (Chưa K.Hoạt 3)', 0, 11, -1, 245.0000, 0.0000, 70, 90),
	(15, 20, 1050000, 'Vị Giác (Chưa K.Hoạt 4)', 0, 62, 63, 0.0060, 0.0060, 60, 90),
	(16, 20, 1260000, 'Vị Giác (Chưa K.Hoạt 5)', 0, 1, -1, 3673.0000, 0.0000, 55, 90),
	(17, 20, 1470000, 'Vị Giác (Chưa K.Hoạt 6)', 0, 4, 5, 918.0000, 735.0000, 50, 90),
	(18, 20, 1680000, 'Vị Giác (Chưa K.Hoạt 7)', 0, 11, -1, 367.0000, 0.0000, 45, 90),
	(19, 28, 1890000, 'Vị Giác (Chưa K.Hoạt 8)', 0, 62, 63, 0.0090, 0.0090, 40, 90),
	(20, 32, 2100000, 'Vị Giác (Chưa K.Hoạt 9)', 0, 13, -1, 1.2200, 0.0000, 35, 90),
	(21, 32, 2310000, 'Vị Giác (Chưa K.Hoạt 10)', 0, 31, -1, 1.2200, 0.0000, 30, 90),
	(22, 32, 2520000, 'Vị Giác (Đã K.Hoạt)', 1, 34, -1, 1.2200, 0.0000, 30, 90),
	(23, 18, 610000, 'Khứu Giác (Chưa K.Hoạt 1)', 0, 1, -1, 2939.0000, 0.0000, 80, 100),
	(24, 18, 915000, 'Khứu Giác (Chưa K.Hoạt 2)', 0, 4, 5, 735.0000, 585.0000, 70, 100),
	(25, 18, 1220000, 'Khứu Giác (Chưa K.Hoạt 3)', 0, 11, -1, 294.0000, 0.0000, 60, 100),
	(26, 26, 1525000, 'Khứu Giác (Chưa K.Hoạt 4)', 0, 62, 63, 0.0072, 0.0072, 55, 100),
	(27, 26, 1830000, 'Khứu Giác (Chưa K.Hoạt 5)', 0, 1, -1, 4408.0000, 0.0000, 50, 100),
	(28, 26, 2135000, 'Khứu Giác (Chưa K.Hoạt 6)', 0, 4, 5, 1102.0000, 882.0000, 45, 100),
	(29, 26, 2440000, 'Khứu Giác (Chưa K.Hoạt 7)', 0, 11, -1, 441.0000, 0.0000, 40, 100),
	(30, 36, 2745000, 'Khứu Giác (Chưa K.Hoạt 8)', 0, 62, 63, 0.0107, 0.0107, 35, 100),
	(31, 42, 3050000, 'Khứu Giác (Chưa K.Hoạt 9)', 0, 13, -1, 1.4700, 0.0000, 30, 100),
	(32, 42, 3355000, 'Khứu Giác (Chưa K.Hoạt 10)', 0, 31, -1, 1.4700, 0.0000, 30, 100),
	(33, 42, 3660000, 'Khứu Giác (Đã K.Hoạt)', 1, 34, -1, 1.4700, 0.0000, 30, 100),
	(34, 22, 860000, 'Thị Giác (Chưa K.Hoạt 1)', 0, 1, -1, 3429.0000, 0.0000, 70, 110),
	(35, 22, 1290000, 'Thị Giác (Chưa K.Hoạt 2)', 0, 4, 5, 857.0000, 686.0000, 60, 110),
	(36, 22, 1720000, 'Thị Giác (Chưa K.Hoạt 3)', 0, 11, -1, 343.0000, 0.0000, 55, 110),
	(37, 32, 2150000, 'Thị Giác (Chưa K.Hoạt 4)', 0, 62, 63, 0.0084, 0.0084, 50, 110),
	(38, 32, 2580000, 'Thị Giác (Chưa K.Hoạt 5)', 0, 1, -1, 5143.0000, 0.0000, 45, 110),
	(39, 32, 3010000, 'Thị Giác (Chưa K.Hoạt 6)', 0, 4, 5, 1286.0000, 1029.0000, 40, 110),
	(40, 32, 3440000, 'Thị Giác (Chưa K.Hoạt 7)', 0, 11, -1, 514.0000, 0.0000, 35, 110),
	(41, 44, 3870000, 'Thị Giác (Chưa K.Hoạt 8)', 0, 62, 63, 0.0125, 0.0125, 30, 110),
	(42, 52, 4300000, 'Thị Giác (Chưa K.Hoạt 9)', 0, 13, -1, 1.7100, 0.0000, 30, 110),
	(43, 52, 4730000, 'Thị Giác (Chưa K.Hoạt 10)', 0, 31, -1, 1.7100, 0.0000, 30, 110),
	(44, 52, 5160000, 'Thị Giác (Đã K.Hoạt)', 1, 34, -1, 1.7100, 0.0000, 30, 110),
	(45, 26, 1190000, 'Xúc Giác (Chưa K.Hoạt 1)', 0, 1, -1, 3918.0000, 0.0000, 60, 120),
	(46, 26, 1785000, 'Xúc Giác (Chưa K.Hoạt 2)', 0, 4, 5, 980.0000, 784.0000, 55, 120),
	(47, 26, 2380000, 'Xúc Giác (Chưa K.Hoạt 3)', 0, 11, -1, 392.0000, 0.0000, 50, 120),
	(48, 38, 2975000, 'Xúc Giác (Chưa K.Hoạt 4)', 0, 62, 63, 0.0095, 0.0095, 45, 120),
	(49, 38, 3570000, 'Xúc Giác (Chưa K.Hoạt 5)', 0, 1, -1, 5878.0000, 0.0000, 40, 120),
	(50, 38, 4165000, 'Xúc Giác (Chưa K.Hoạt 6)', 0, 4, 5, 1469.0000, 1176.0000, 35, 120),
	(51, 38, 4760000, 'Xúc Giác (Chưa K.Hoạt 7)', 0, 11, -1, 588.0000, 0.0000, 30, 120),
	(52, 56, 5355000, 'Xúc Giác (Chưa K.Hoạt 8)', 0, 62, 63, 0.0143, 0.0143, 30, 120),
	(53, 64, 5950000, 'Xúc Giác (Chưa K.Hoạt 9)', 0, 13, -1, 1.9600, 0.0000, 30, 120),
	(54, 64, 6545000, 'Xúc Giác (Chưa K.Hoạt 10)', 0, 31, -1, 1.9600, 0.0000, 30, 120),
	(55, 64, 7140000, 'Xúc Giác (Đã K.Hoạt)', 1, 34, -1, 1.9600, 0.0000, 30, 120),
	(56, 30, 1580000, 'Tiên Tri (Chưa K.Hoạt 1)', 0, 1, -1, 4408.0000, 0.0000, 55, 130),
	(57, 30, 2370000, 'Tiên Tri (Chưa K.Hoạt 2)', 0, 4, 5, 1102.0000, 882.0000, 50, 130),
	(58, 30, 3160000, 'Tiên Tri (Chưa K.Hoạt 3)', 0, 11, -1, 441.0000, 0.0000, 45, 130),
	(59, 44, 3950000, 'Tiên Tri (Chưa K.Hoạt 4)', 0, 62, 63, 0.0107, 0.0107, 40, 130),
	(60, 44, 4740000, 'Tiên Tri (Chưa K.Hoạt 5)', 0, 1, -1, 6612.0000, 0.0000, 35, 130),
	(61, 44, 5530000, 'Tiên Tri (Chưa K.Hoạt 6)', 0, 4, 5, 1653.0000, 1322.0000, 30, 130),
	(62, 44, 6320000, 'Tiên Tri (Chưa K.Hoạt 7)', 0, 11, -1, 660.0000, 0.0000, 30, 130),
	(63, 64, 7110000, 'Tiên Tri (Chưa K.Hoạt 8)', 0, 62, 63, 0.0161, 0.0161, 30, 130),
	(64, 74, 7900000, 'Tiên Tri (Chưa K.Hoạt 9)', 0, 13, -1, 2.2000, 0.0000, 30, 130),
	(65, 74, 8690000, 'Tiên Tri (Chưa K.Hoạt 10)', 0, 31, -1, 2.2000, 0.0000, 30, 130),
	(66, 74, 9480000, 'Tiên Tri (Đã K.Hoạt)', 2, 34, -1, 2.2000, 0.0000, 30, 130),
	(67, 34, 2030000, 'Ngoại Cảm (Chưa K.Hoạt 1)', 0, 1, -1, 4898.0000, 0.0000, 50, 140),
	(68, 34, 3045000, 'Ngoại Cảm (Chưa K.Hoạt 2)', 0, 4, 5, 1224.0000, 980.0000, 45, 140),
	(69, 34, 4060000, 'Ngoại Cảm (Chưa K.Hoạt 3)', 0, 11, -1, 490.0000, 0.0000, 40, 140),
	(70, 50, 5075000, 'Ngoại Cảm (Chưa K.Hoạt 4)', 0, 62, 63, 0.0119, 0.0119, 35, 140),
	(71, 50, 6090000, 'Ngoại Cảm (Chưa K.Hoạt 5)', 0, 1, -1, 7347.0000, 0.0000, 30, 140),
	(72, 50, 7105000, 'Ngoại Cảm (Chưa K.Hoạt 6)', 0, 4, 5, 1837.0000, 1469.0000, 30, 140),
	(73, 50, 8120000, 'Ngoại Cảm (Chưa K.Hoạt 7)', 0, 11, -1, 735.0000, 0.0000, 30, 140),
	(74, 74, 9135000, 'Ngoại Cảm (Chưa K.Hoạt 8)', 0, 62, 63, 0.0179, 0.0179, 30, 140),
	(75, 84, 10150000, 'Ngoại Cảm (Chưa K.Hoạt 9)', 0, 13, -1, 2.4600, 0.0000, 30, 140),
	(76, 84, 11165000, 'Ngoại Cảm (Chưa K.Hoạt 10)', 0, 31, -1, 2.4600, 0.0000, 30, 140),
	(77, 84, 12180000, 'Ngoại Cảm (Đã K.Hoạt)', 2, 34, -1, 2.4600, 0.0000, 30, 140);


--
-- PostgreSQL database dump complete
--

-- \unrestrict aptBzESYUt186IXflJZiktvwkhJKVtWo2dPXfWDHuRU56ektiaG0bAiFV5i8IWi


SET session_replication_role = origin;
