SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict 2coNVQeSZ8vzr11gVAhKudZEGRVi1HJd0VbM43jdhMJ0vu0JhV1ItW8CxZOVXA3

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: data_tbl_dress; Type: TABLE DATA; Schema: data; Owner: -
--

INSERT INTO "data"."data_tbl_dress" ("id", "color", "equipt_id", "is_open", "name", "num1", "num2", "position", "prop1", "prop2", "prop3", "prop4", "prop_num1", "prop_num2", "prop_num3", "prop_num4", "recipe_id", "type") VALUES
	(1001, 3, 1961, 1, 'Thời Trang Học Sinh', 75, 15, 1, 1, 4, 5, 11, 100, 25, 25, 10, 1001, 1),
	(1002, 3, 1962, 1, 'Thời Trang Âu Lạc ', 75, 15, 2, 1, 4, 5, 11, 100, 25, 25, 10, 1002, 1),
	(1003, 3, 1963, 1, 'Thời Trang Quý Tộc', 75, 15, 3, 1, 4, 5, 11, 100, 25, 25, 10, 1003, 1),
	(1004, 3, 1964, 1, 'Thời Trang Hawaii', 75, 15, 4, 1, 4, 5, 11, 100, 25, 25, 10, 1004, 1),
	(1005, 3, 1965, 1, 'Thời Trang Trung Hoa', 75, 15, 5, 1, 4, 5, 11, 100, 25, 25, 10, 1005, 1),
	(1006, 3, 1966, 1, 'Thời Trang Cowboy', 75, 15, 6, 1, 4, 5, 11, 100, 25, 25, 10, 1006, 1),
	(1007, 3, 1967, 1, 'Thời Trang Manga', 75, 15, 7, 1, 4, 5, 11, 100, 25, 25, 10, 1007, 1),
	(1008, 3, 1968, 1, 'Thời Trang Luffy', 75, 15, 8, 1, 4, 5, 11, 100, 25, 25, 10, 1008, 1),
	(1009, 3, 1969, 1, 'Thời Trang Quản Gia', 75, 15, 9, 1, 4, 5, 11, 100, 25, 25, 10, 1009, 1),
	(1010, 3, 1970, 1, 'Cô Bé Quàng Khăn Đỏ', 75, 15, 10, 1, 4, 5, 11, 100, 25, 25, 10, 1010, 1),
	(1011, 3, 1971, 1, 'Thời Trang Cosplay', 75, 15, 11, 1, 4, 5, 11, 100, 25, 25, 10, 1011, 1),
	(1012, 3, 1972, 1, 'Thời Trang Giáng Sinh', 75, 15, 12, 1, 4, 5, 11, 100, 25, 25, 10, 1012, 1),
	(1013, 3, 1973, 1, 'Thời Trang Năm Mới', 75, 15, 13, 1, 4, 5, 11, 100, 25, 25, 10, 1013, 1),
	(1014, 3, 1974, 1, 'Thời Trang Tình Nhân', 75, 15, 14, 1, 4, 5, 11, 100, 25, 25, 10, 1014, 1),
	(1015, 3, 1975, 1, 'Thời Trang Xì - tin', 75, 15, 15, 1, 4, 5, 11, 100, 25, 25, 10, 1015, 1),
	(1016, 3, 1976, 1, 'Thời Trang Thể Thao', 75, 15, 16, 1, 4, 5, 11, 100, 25, 25, 10, 1016, 1),
	(1017, 4, 1977, 1, 'Thời Trang Băng Tuyết Kỳ Duyên', 75, 15, 17, 1, 4, 5, 11, 200, 50, 50, 20, 1017, 1),
	(1018, 4, 1978, 1, 'Thời Trang Chiến Binh Hoàng Kim', 75, 15, 18, 1, 4, 5, 11, 200, 50, 50, 20, 1018, 1),
	(1019, 4, 1979, 1, 'Thời Trang Nhạc Công Hoàng Kim', 75, 15, 19, 1, 4, 5, 11, 200, 50, 50, 20, 1019, 1),
	(1020, 4, 1980, 1, 'Thời Trang Danh Y Hoàng Kim', 75, 15, 20, 1, 4, 5, 11, 200, 50, 50, 20, 1020, 1),
	(1021, 4, 1981, 1, 'Thời Trang Xạ Thủ Hoàng Kim', 75, 15, 21, 1, 4, 5, 11, 200, 50, 50, 20, 1021, 1),
	(1022, 4, 1982, 1, 'Thời Trang Thợ Săn Hoàng Kim', 75, 15, 22, 1, 4, 5, 11, 200, 50, 50, 20, 1022, 1),
	(1023, 4, 1983, 1, 'Thời Trang Hiệp Sĩ Hoàng Kim', 75, 15, 23, 1, 4, 5, 11, 200, 50, 50, 20, 1023, 1),
	(2001, 3, 1984, 1, 'Chổi Phi Thiên', 75, 15, 1, 1, 4, 5, 11, 100, 25, 25, 10, 1024, 2),
	(2002, 3, 1985, 1, 'Thảm Ma Pháp', 75, 15, 2, 1, 4, 5, 11, 100, 25, 25, 10, 1025, 2),
	(2003, 3, 1986, 1, 'Xe Trượt Giáng Sinh', 75, 15, 3, 1, 4, 5, 11, 100, 25, 25, 10, 1026, 2),
	(2004, 3, 1987, 1, 'Bách Linh Phong Vũ', 75, 15, 4, 1, 4, 5, 11, 100, 25, 25, 10, 1027, 2),
	(2005, 3, 1988, 1, 'Phi Thuyền Ngân Hà', 75, 15, 5, 1, 4, 5, 11, 100, 25, 25, 10, 1028, 2),
	(2006, 3, 1989, 1, 'Cân Đẩu Vân', 75, 15, 6, 1, 4, 5, 11, 100, 25, 25, 10, 1029, 2),
	(2007, 3, 1990, 1, 'Bông Gòn Nhỏ', 75, 15, 7, 1, 4, 5, 11, 100, 25, 25, 10, 1030, 2),
	(2008, 3, 1991, 1, 'Bông Gòn\r', 75, 15, 8, 1, 4, 5, 11, 100, 25, 25, 10, 1031, 2),
	(2009, 4, 1992, 1, 'Máy Bay Giấy Hồng', 75, 15, 9, 1, 4, 5, 11, 200, 50, 50, 20, 1032, 2),
	(2010, 4, 1993, 1, 'Máy Bay Giấy Lam', 75, 15, 10, 1, 4, 5, 11, 200, 50, 50, 20, 1033, 2),
	(2011, 4, 1994, 1, 'Furi', 75, 15, 11, 1, 4, 5, 11, 200, 50, 50, 20, 1034, 2),
	(2012, 4, 1995, 1, 'Phi Long', 75, 15, 12, 1, 4, 5, 11, 200, 50, 50, 20, 1035, 2),
	(2013, 4, 1996, 1, 'Ngựa Một Sừng', 75, 15, 13, 1, 4, 5, 11, 200, 50, 50, 20, 1036, 2),
	(2014, 4, 1997, 1, 'Hỏa Phụng Hoàng', 75, 15, 14, 1, 4, 5, 11, 200, 50, 50, 20, 1037, 2),
	(1025, 4, 2003, 1, 'Thời Trang Brazil ', 75, 15, 25, 1, 4, 5, 11, 200, 50, 50, 20, 1040, 1),
	(2015, 4, 2004, 1, 'Xe Bay Ếch Xanh', 75, 15, 15, 1, 4, 5, 11, 200, 50, 50, 20, 1038, 2),
	(1026, 4, 2015, 1, 'Thời Trang Hoài Niệm Chiến Binh', 75, 15, 26, 1, 4, 5, 11, 200, 50, 50, 20, 1041, 1),
	(1027, 4, 2016, 1, 'Thời Trang Hoài Niệm Nhạc Công', 75, 15, 27, 1, 4, 5, 11, 200, 50, 50, 20, 1042, 1),
	(1029, 4, 2018, 1, 'Thời Trang Hoài Niệm Xạ Thủ', 75, 15, 29, 1, 4, 5, 11, 200, 50, 50, 20, 1044, 1),
	(1030, 4, 2019, 1, 'Thời Trang Hoài Niệm Thợ Săn', 75, 15, 30, 1, 4, 5, 11, 200, 50, 50, 20, 1045, 1),
	(1031, 4, 2020, 1, 'Thời Trang Hoài Niệm Hiệp Sĩ', 75, 15, 31, 1, 4, 5, 11, 200, 50, 50, 20, 1046, 1),
	(1032, 4, 2042, 1, 'Thời Trang Thần Kỳ Hiệp Lữ', 75, 15, 36, 1, 4, 5, 11, 200, 50, 50, 20, 1047, 1),
	(1033, 3, 2043, 1, 'Thời Trang Arale', 75, 15, 32, 1, 4, 5, 11, 100, 25, 25, 10, 1048, 1),
	(1034, 3, 2044, 1, 'Thời Trang Arale Hồng', 75, 15, 33, 1, 4, 5, 11, 100, 25, 25, 10, 1049, 1),
	(1035, 3, 2045, 1, 'Thời Trang Arale Đỏ', 75, 15, 34, 1, 4, 5, 11, 100, 25, 25, 10, 1050, 1),
	(1036, 4, 2046, 1, 'Thời Trang Black Rock Shooter', 75, 15, 37, 1, 4, 5, 11, 200, 50, 50, 20, 1051, 1),
	(1037, 4, 2047, 1, 'Thời Trang Thiên Thần Ác Quỷ', 75, 15, 38, 1, 4, 5, 11, 200, 50, 50, 20, 1052, 1),
	(1038, 4, 2048, 1, 'Thời Trang Hoàng Gia', 75, 15, 39, 1, 4, 5, 11, 200, 50, 50, 20, 1053, 1),
	(1039, 4, 2049, 1, 'Thời Trang Wonderland', 75, 15, 40, 1, 4, 5, 11, 200, 50, 50, 20, 1054, 1),
	(1040, 4, 2050, 1, 'Thời Trang Tân Xuân', 75, 15, 41, 1, 4, 5, 11, 200, 50, 50, 20, 1055, 1),
	(1041, 4, 2051, 1, 'Thời Trang Dạ Tiệc', 75, 15, 42, 1, 4, 5, 11, 200, 50, 50, 20, 1056, 1),
	(1042, 4, 2052, 1, 'Thời Trang Baymax', 75, 15, 35, 1, 4, 5, 11, 200, 50, 50, 20, 1057, 1),
	(2016, 4, 2053, 1, 'Phi Hành Baymax\r', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1058, 2),
	(1043, 4, 2055, 1, 'Thời Trang Huyết Sắc Chiến Thần', 75, 15, 43, 1, 4, 5, 11, 200, 50, 50, 20, 1059, 1),
	(1044, 4, 2326, 1, 'Thời Trang Trung Thu', 75, 15, 44, 1, 4, 5, 11, 200, 50, 50, 20, 1060, 1),
	(1045, 4, 2327, 1, 'Thời Trang Cương Thi Thi', 75, 15, 45, 1, 4, 5, 11, 200, 50, 50, 20, 1061, 1),
	(1046, 4, 2328, 1, 'Thời Trang Cao Bồi', 75, 15, 46, 1, 4, 5, 11, 200, 50, 50, 20, 1062, 1),
	(1047, 4, 2329, 1, 'Thời Trang Ranger', 75, 15, 47, 1, 4, 5, 11, 200, 50, 50, 20, 1063, 1),
	(1048, 4, 2330, 1, 'Thời Trang Shuke Beita', 75, 15, 48, 1, 4, 5, 11, 200, 50, 50, 20, 1064, 1),
	(1049, 4, 2331, 1, 'Thời Trang Sơ Hạ', 75, 15, 49, 1, 4, 5, 11, 200, 50, 50, 20, 1065, 1),
	(1050, 4, 2332, 1, 'Thời Trang Wonderfull', 75, 15, 50, 1, 4, 5, 11, 200, 50, 50, 20, 1066, 1),
	(1051, 4, 2333, 1, 'Thời Trang Lolita', 75, 15, 51, 1, 4, 5, 11, 200, 50, 50, 20, 1067, 1),
	(1052, 4, 2334, 1, 'Thời Trang Đao Kiếm Thần Vực', 75, 15, 52, 1, 4, 5, 11, 200, 50, 50, 20, 1068, 1),
	(1053, 4, 2351, 1, 'Thời Trang Gumiho', 75, 15, 53, 1, 4, 5, 11, 200, 50, 50, 20, 1069, 1),
	(1054, 4, 2352, 1, 'Thời Trang Khu Rừng Cổ Tích', 75, 15, 54, 1, 4, 5, 11, 200, 50, 50, 20, 1070, 1),
	(1055, 4, 2359, 1, 'Thời Trang Hoa Chi', 75, 15, 55, 1, 4, 5, 11, 200, 50, 50, 20, 1071, 1),
	(1056, 4, 2375, 1, 'Thời Trang Sắc Xuân', 75, 15, 56, 1, 4, 5, 11, 200, 50, 50, 20, 1072, 1),
	(2021, 4, 2380, 1, 'Phi Hành Tùng Tước Uyên Ngư', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1077, 2),
	(2020, 4, 2379, 1, 'Phi Hành Cư Cư', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1076, 2),
	(2019, 4, 2378, 1, 'Phi Hành Trang Sinh Mộng', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1075, 2),
	(2018, 4, 2377, 1, 'Phi Hành Thần Dược', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1074, 2),
	(2017, 4, 2376, 1, 'Phi Hành Mogfi', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1073, 2),
	(2022, 4, 2381, 1, 'Phi Hành Băng Ngưng', 75, 15, 16, 1, 4, 5, 11, 200, 50, 50, 20, 1078, 2),
	(1057, 4, 2382, 1, 'Thời Trang Truyền Thuyết Biển', 75, 15, 57, 1, 4, 5, 11, 200, 50, 50, 20, 1079, 1),
	(1058, 4, 2384, 1, 'Thời Trang Galaxy', 75, 15, 58, 1, 4, 5, 11, 200, 50, 50, 20, 1080, 1),
	(1059, 4, 2386, 1, 'Thời Trang Phiêu Lưu', 75, 15, 59, 1, 4, 5, 11, 200, 50, 50, 20, 1081, 1),
	(1060, 4, 2400, 1, 'Thời Trang Fantasy', 75, 15, 60, 1, 4, 5, 11, 200, 50, 50, 20, 1082, 1),
	(1024, 4, 2002, 1, 'Thời Trang Bikini', 75, 15, 24, 1, 4, 5, 11, 200, 50, 50, 20, 1039, 1),
	(1028, 4, 2017, 1, 'Thời Trang Hoài Niệm Danh Y', 75, 15, 28, 1, 4, 5, 11, 200, 50, 50, 20, 1043, 1),
	(1061, 4, 2402, 1, 'Thời trang Cá Lượn Bên Sen', 75, 15, 61, 1, 4, 5, 11, 200, 50, 50, 20, 1083, 1),
	(1062, 4, 2417, 1, 'Thời trang Giai Điệu Tuyết Trắng', 75, 15, 62, 1, 4, 5, 11, 200, 50, 50, 20, 1084, 1),
	(1063, 4, 2418, 1, 'Thời trang Tai Mèo Gothic', 75, 15, 63, 1, 4, 5, 11, 200, 50, 50, 20, 1085, 1),
	(1064, 4, 2416, 1, 'Thời trang Rừng Đêm Huyền Ảo', 75, 15, 64, 1, 4, 5, 11, 200, 50, 50, 20, 1086, 1),
	(1065, 4, 2419, 1, 'Thời trang Bông Tuyết Mềm Mại', 75, 15, 65, 1, 4, 5, 11, 200, 50, 50, 20, 1087, 1),
	(1066, 4, 2421, 1, 'Thời trang Màn Sao Bay Lượn', 75, 15, 66, 1, 4, 5, 11, 200, 50, 50, 20, 1088, 1),
	(1067, 4, 2423, 1, 'Thời trang Tiệc Kẹo Ngọt', 75, 15, 67, 1, 4, 5, 11, 200, 50, 50, 20, 1089, 1),
	(1068, 4, 2429, 1, 'Thời trang Tuyết Rơi Mùa Đông', 75, 15, 68, 1, 4, 5, 11, 200, 50, 50, 20, 1090, 1),
	(1069, 4, 2428, 1, 'Thời trang Giấc Mơ Bí Ngô Ngọt Ngào', 75, 15, 69, 1, 4, 5, 11, 200, 50, 50, 20, 1091, 1),
	(1070, 4, 2430, 1, 'Thời trang Bãi Biển Mộng Mơ', 75, 15, 70, 1, 4, 5, 11, 200, 50, 50, 20, 1092, 1),
	(1071, 4, 2427, 1, 'Thời trang Nguyên Lượng', 75, 15, 71, 1, 4, 5, 11, 200, 50, 50, 20, 1093, 1);


--
-- PostgreSQL database dump complete
--

-- \unrestrict 2coNVQeSZ8vzr11gVAhKudZEGRVi1HJd0VbM43jdhMJ0vu0JhV1ItW8CxZOVXA3


SET session_replication_role = origin;
