SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict ocX3l5M19MuLlhlxtfRkH6112edc0yYpj60gqgdyp4L73eWpvyYAs1AKBnKqnVZ

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: data_tbl_guide; Type: TABLE DATA; Schema: data; Owner: -
--

INSERT INTO "data"."data_tbl_guide" ("id", "find_npc_id", "finish_type", "level", "mouse_x", "mouse_y", "prompt_text", "prompt_type", "reference", "sc_npcid", "sc_other_id", "sc_pid", "sc_qname", "type") VALUES
	(1, 240, 9, 5, 0, 0, '新手指引|欢迎你来到魔力学堂，这是一个梦幻宏大的世界，现在我们就开始这段奇妙的旅程吧，首先来学习如何做任务吧。一个任务有<font color="#FF0000">【接任务】</font>与<font color="#FF0000">【交任务】</font>两个部分，看见前面NPC头上的金色框框了吗？那就表示这个NPC有任务可以接哦！走过去，单击NPC就可以看见可以接的任务啦！', 1, -1, -1, 1, 31, NULL, 9),
	(2, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 240, -1, 530, '实习开始', 0),
	(3, -1, -1, 10, 60, 353, '点击此处接受任务', 0, 280, 240, -1, 280, '实习开始', 0),
	(5, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 231, -1, 530, '实习开始', 0),
	(6, -1, -1, 10, 50, 353, '点击此处完成任务', 0, 280, 231, -1, 280, '实习开始', 0),
	(7, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 231, -1, 530, '领取武器', 0),
	(8, -1, -1, 10, 60, 353, '点击此处接受任务', 0, 280, 231, -1, 280, '领取武器', 0),
	(12, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 232, -1, 530, '领取防具', 0),
	(9, -1, -1, 10, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, -1, 2100, '领取武器', 0),
	(10, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 232, -1, 530, '领取武器', 0),
	(11, -1, -1, 10, 60, 353, '点击此处完成任务', 0, 280, 232, -1, 280, '领取武器', 0),
	(13, -1, -1, 10, 60, 353, '点击此处接受任务', 0, 280, 232, -1, 280, '领取防具', 0),
	(14, -1, -1, 10, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, -1, 2100, '领取防具', 0),
	(15, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 238, -1, 530, '领取防具', 0),
	(16, -1, -1, 10, 60, 353, '点击此处完成任务', 0, 280, 238, -1, 280, '领取防具', 0),
	(4, -1, -1, 10, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, -1, 2100, '实习开始', 0),
	(17, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 238, -1, 530, '领取宠物', 0),
	(18, -1, -1, 10, 60, 353, '点击此处接受任务', 0, 280, 238, -1, 280, '领取宠物', 0),
	(19, -1, -1, 10, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, -1, 2100, '领取宠物', 0),
	(20, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 237, -1, 530, '领取宠物', 0),
	(21, -1, -1, 10, 60, 353, '点击此处完成任务', 0, 280, 237, -1, 280, '领取宠物', 0),
	(22, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 237, -1, 530, '面见治安官', 0),
	(23, -1, -1, 10, 60, 353, '点击此处接受任务', 0, 280, 237, -1, 280, '面见治安官', 0),
	(24, -1, -1, 10, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, -1, 2100, '面见治安官', 0),
	(25, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 455, -1, 530, '面见治安官', 0),
	(26, -1, -1, 10, 60, 353, '点击此处完成任务', 0, 280, 455, -1, 280, '面见治安官', 0),
	(27, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 455, -1, 530, '治安官的委托', 0),
	(28, -1, -1, 10, 60, 353, '点击此处接受任务', 0, 280, 455, -1, 280, '治安官的委托', 0),
	(29, -1, -1, 10, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, -1, 2100, '治安官的委托', 0),
	(30, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 239, -1, 530, '治安官的委托', 0),
	(31, -1, -1, 10, 60, 353, '点击此处完成任务', 0, 280, 239, -1, 280, '治安官的委托', 0),
	(32, -1, -1, 10, 40, 270, '点击此处接受任务', 0, 530, 239, -1, 530, '去原野训练', 0),
	(33, -1, -1, 10, 60, 353, '点击此处自动走到‘云台原野’', 0, 280, 239, -1, 280, '去原野训练', 0),
	(37, -1, 11, 5, -40, 63, '点击NPC名字自动寻路', 0, 2100, -1, 3, -1, NULL, 11),
	(34, -1, -1, 10, 40, 270, '点击此处完成任务', 0, 530, 430, -1, 530, '去原野训练', 0),
	(35, -1, 0, 10, 60, 353, '点击此处完成任务', 0, 280, 430, -1, 280, '去原野训练', 0),
	(38, -1, -1, 150, 600, 100, '请点击此处编辑您的庄园宠物配置', 0, 801, -1, -1, 801, NULL, 2),
	(39, -1, -1, 150, 42, 15, '点击参加守护庄园的宠物', 0, 831, -1, -1, 831, NULL, 2),
	(40, -1, -1, 150, 270, 170, '点击这里将宠物拖放到‘出战列表’', 0, 831, -1, 1, 831, NULL, 2),
	(41, -1, -1, 150, 270, 200, '点击这里配置宠物自动战斗的AI', 0, 831, -1, 2, 831, NULL, 2),
	(42, -1, -1, 150, 20, 0, '点击这里选取宠物技能', 0, 830, -1, -1, 830, NULL, 2),
	(43, -1, -1, 150, 180, 155, '点击这里将技能添加到施放列表', 0, 830, -1, 1, 830, NULL, 2),
	(44, -1, -1, 150, 280, 20, '点击这里选择该技能的施放对象\t', 0, 830, -1, 2, 830, NULL, 2),
	(45, -1, -1, 150, 355, 300, '点击这里确认配置', 0, 830, -1, 3, 830, NULL, 2),
	(46, -1, -1, 150, 330, 250, '点击这里保存配置', 0, 831, -1, 4, 830, NULL, 2),
	(47, -1, 2, 200, 0, 0, NULL, 0, -1, -1, 4, 830, NULL, 2);


--
-- PostgreSQL database dump complete
--

-- \unrestrict ocX3l5M19MuLlhlxtfRkH6112edc0yYpj60gqgdyp4L73eWpvyYAs1AKBnKqnVZ


SET session_replication_role = origin;
