SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict N6V3claB3oafq3dEIVQlvNqCbdOLvf0oiiaYLZnclWNXwXWPcuy3fwd7hbJiMRD

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: data_tbl_pet_stone; Type: TABLE DATA; Schema: data; Owner: -
--

INSERT INTO "data"."data_tbl_pet_stone" ("id", "cost_sil", "energy_flag", "energy_id", "icon_code", "level", "name", "next_id", "prop_num", "prop_type", "resolve_num") VALUES
	(1, 100000, 0, 0, 4030200300001, 1, 'Mệnh Thạch Ám Viêm', 2, 270.00, 1, 3),
	(14, 150000, 0, 0, 4030200300014, 2, 'Lý Công Thạch Liệt K', 15, 200.00, 4, 10),
	(15, 200000, 0, 0, 4030200300015, 3, 'Lý Công Thạch Thường', 16, 540.00, 4, 18),
	(16, 250000, 0, 0, 4030200300016, 4, 'Lý Công Thạch Lấp Lá', 17, 990.00, 4, 31),
	(17, 300000, 0, 18, 4030200300017, 5, 'Lý Công Thạch Hoàn M', 0, 2350.00, 4, 54),
	(18, 0, 1, 0, 4030200300018, 6, 'Lý Công Thạch Tụ Lin', 0, 2500.00, 4, 60),
	(19, 100000, 0, 0, 4030200300019, 1, 'Pháp Công Thạch Ám V', 20, 75.00, 5, 3),
	(20, 150000, 0, 0, 4030200300020, 2, 'Pháp Công Thạch Liệt', 21, 200.00, 5, 10),
	(21, 200000, 0, 0, 4030200300021, 3, 'Pháp Công Thạch Thườ', 22, 540.00, 5, 18),
	(22, 250000, 0, 0, 4030200300022, 4, 'Pháp Công Thạch Lấp ', 23, 990.00, 5, 31),
	(23, 300000, 0, 24, 4030200300023, 5, 'Pháp Công Thạch Hoàn', 0, 2350.00, 5, 54),
	(24, 0, 1, 0, 4030200300024, 6, 'Pháp Công Thạch Tụ L', 0, 2500.00, 5, 60),
	(25, 100000, 0, 0, 4030200300025, 1, 'Lý Phòng Thạch Ám Vi', 26, 215.00, 6, 3),
	(26, 150000, 0, 0, 4030200300026, 2, 'Lý Phòng Thạch Liệt ', 27, 640.00, 6, 10),
	(27, 200000, 0, 0, 4030200300027, 3, 'Lý Phòng Thạch Thườn', 28, 1750.00, 6, 18),
	(28, 250000, 0, 0, 4030200300028, 4, 'Lý Phòng Thạch Lấp L', 29, 3150.00, 6, 31),
	(29, 300000, 0, 30, 4030200300029, 5, 'Lý Phòng Thạch Hoàn ', 0, 7500.00, 6, 54),
	(30, 0, 1, 0, 4030200300030, 6, 'Lý Phòng Thạch Tụ Li', 0, 8750.00, 6, 60),
	(31, 100000, 0, 0, 4030200300031, 1, 'Pháp Phòng Thạch Ám ', 32, 215.00, 7, 3),
	(32, 150000, 0, 0, 4030200300032, 2, 'Pháp Phòng Thạch Liệ', 33, 640.00, 7, 10),
	(33, 200000, 0, 0, 4030200300033, 3, 'Pháp Phòng Thạch Thư', 34, 1750.00, 7, 18),
	(34, 250000, 0, 0, 4030200300034, 4, 'Pháp Phòng Thạch Lấp', 35, 3150.00, 7, 31),
	(35, 300000, 0, 36, 4030200300035, 5, 'Pháp Phòng Thạch Hoà', 0, 7500.00, 7, 54),
	(36, 0, 1, 0, 4030200300036, 6, 'Pháp Phòng Thạch Tụ ', 0, 8750.00, 7, 60),
	(37, 100000, 0, 0, 4030200300037, 1, 'Bạo Kích Thạch Ám Vi', 38, 0.20, 13, 3),
	(38, 150000, 0, 0, 4030200300038, 2, 'Bạo Kích Thạch Liệt ', 39, 0.50, 13, 10),
	(39, 200000, 0, 0, 4030200300039, 3, 'Bạo Kích Thạch Thườn', 40, 0.74, 13, 18),
	(40, 250000, 0, 0, 4030200300040, 4, 'Bạo Kích Thạch Lấp L', 41, 1.40, 13, 31),
	(41, 300000, 0, 42, 4030200300041, 5, 'Bạo Kích Thạch Hoàn ', 0, 2.00, 13, 54),
	(42, 0, 1, 0, 4030200300042, 6, 'Bạo Kích Thạch Tụ Li', 0, 2.25, 13, 60),
	(43, 100000, 0, 0, 4030200300043, 1, 'Kháng Bạo Thạch Ám V', 44, 0.20, 31, 3),
	(44, 150000, 0, 0, 4030200300044, 2, 'Kháng Bạo Thạch Liệt', 45, 0.50, 31, 10),
	(45, 200000, 0, 0, 4030200300045, 3, 'Kháng Bạo Thạch Thườ', 46, 0.74, 31, 18),
	(46, 250000, 0, 0, 4030200300046, 4, 'Kháng Bạo Thạch Lấp ', 47, 1.40, 31, 31),
	(47, 300000, 0, 48, 4030200300047, 5, 'Kháng Bạo Thạch Hoàn', 0, 2.00, 31, 54),
	(48, 0, 1, 0, 4030200300048, 6, 'Kháng Bạo Thạch Tụ L', 0, 2.25, 31, 60),
	(49, 100000, 0, 0, 4030200300049, 1, 'Tốc Thạch Ám Viêm', 50, 45.00, 11, 3),
	(50, 150000, 0, 0, 4030200300050, 2, 'Tốc Thạch Liệt Khai', 51, 100.00, 11, 10),
	(51, 200000, 0, 0, 4030200300051, 3, 'Tốc Thạch Thường', 52, 233.00, 11, 18),
	(52, 250000, 0, 0, 4030200300052, 4, 'Tốc Thạch Lấp Lánh', 53, 400.00, 11, 31),
	(53, 300000, 0, 54, 4030200300053, 5, 'Tốc Thạch Hoàn Mỹ', 0, 940.00, 11, 54),
	(54, 0, 1, 0, 4030200300054, 6, 'Tốc Thạch Tụ Linh', 0, 1000.00, 11, 60),
	(55, 100000, 0, 0, 4030200300055, 1, 'Phản Kích Thạch Ám V', 56, 0.20, 10, 3),
	(56, 150000, 0, 0, 4030200300056, 2, 'Phản Kích Thạch Liệt', 57, 0.50, 10, 10),
	(57, 200000, 0, 0, 4030200300057, 3, 'Phản Kích Thạch Thườ', 58, 0.74, 10, 18),
	(58, 250000, 0, 0, 4030200300058, 4, 'Phản Kích Thạch Lấp ', 59, 1.40, 10, 31),
	(59, 300000, 0, 60, 4030200300059, 5, 'Phản Kích Thạch Hoàn', 0, 2.00, 10, 54),
	(60, 0, 1, 0, 4030200300060, 6, 'Phản Kích Thạch Tụ L', 0, 2.25, 10, 60),
	(61, 100000, 0, 0, 4030200300061, 1, 'Chính Xác Thạch Ám V', 62, 0.30, 8, 3),
	(62, 150000, 0, 0, 4030200300062, 2, 'Chính Xác Thạch Liệt', 63, 0.70, 8, 10),
	(63, 200000, 0, 0, 4030200300063, 3, 'Chính Xác Thạch Thườ', 64, 1.20, 8, 18),
	(64, 250000, 0, 0, 4030200300064, 4, 'Chính Xác Thạch Lấp ', 65, 2.00, 8, 31),
	(65, 300000, 0, 66, 4030200300065, 5, 'Chính Xác Thạch Hoàn', 0, 3.75, 8, 54),
	(66, 0, 1, 0, 4030200300066, 6, 'Chính Xác Thạch Tụ L', 0, 4.20, 8, 60),
	(67, 100000, 0, 0, 4030200300067, 1, 'Né Thạch Ám Viêm', 68, 0.30, 9, 3),
	(68, 150000, 0, 0, 4030200300068, 2, 'Né Thạch Liệt Khai', 69, 0.70, 9, 10),
	(69, 200000, 0, 0, 4030200300069, 3, 'Né Thạch Thường', 70, 1.20, 9, 18),
	(70, 250000, 0, 0, 4030200300070, 4, 'Né Thạch Lấp Lánh', 71, 2.00, 9, 31),
	(71, 300000, 0, 72, 4030200300071, 5, 'Né Thạch Hoàn Mỹ', 0, 3.75, 9, 54),
	(72, 0, 1, 0, 4030200300072, 6, 'Né Thạch Tụ Linh', 0, 4.20, 9, 60),
	(73, 100000, 0, 0, 4030200300073, 1, 'Kháng Xuyên Thạch Ám', 74, 0.20, 61, 3),
	(74, 150000, 0, 0, 4030200300074, 2, 'Kháng Xuyên Thạch Li', 75, 0.35, 61, 10),
	(75, 200000, 0, 0, 4030200300075, 3, 'Kháng Xuyên Thạch Th', 76, 0.60, 61, 18),
	(76, 250000, 0, 0, 4030200300076, 4, 'Kháng Xuyên Thạch Lấ', 77, 0.90, 61, 31),
	(77, 300000, 0, 78, 4030200300077, 5, 'Kháng Xuyên Thạch Ho', 0, 1.25, 61, 54),
	(78, 0, 1, 0, 4030200300078, 6, 'Kháng Xuyên Thạch Tụ', 0, 1.50, 61, 60),
	(79, 100000, 0, 0, 4030200300079, 1, 'Miễn Tử Thạch Ám Viê', 80, 0.20, 34, 3),
	(80, 150000, 0, 0, 4030200300080, 2, 'Miễn Tử Thạch Liệt K', 81, 0.50, 34, 10),
	(81, 200000, 0, 0, 4030200300081, 3, 'Miễn Tử Thạch Thường', 82, 0.90, 34, 18),
	(82, 250000, 0, 0, 4030200300082, 4, 'Miễn Tử Thạch Lấp Lá', 83, 1.50, 34, 31),
	(83, 300000, 0, 84, 4030200300083, 5, 'Miễn Tử Thạch Hoàn M', 0, 2.25, 34, 54),
	(84, 0, 1, 0, 4030200300084, 6, 'Miễn Tử Thạch Tụ Lin', 0, 2.50, 34, 60),
	(85, 100000, 0, 0, 4030200300085, 1, 'Phá Kích Thạch Ám Vi', 86, 0.25, 72, 3),
	(86, 150000, 0, 0, 4030200300086, 2, 'Phá Kích Thạch Liệt ', 87, 0.60, 72, 10),
	(87, 200000, 0, 0, 4030200300087, 3, 'Phá Kích Thạch Thườn', 88, 1.00, 72, 18),
	(88, 250000, 0, 0, 4030200300088, 4, 'Phá Kích Thạch Lấp L', 89, 1.70, 72, 31),
	(89, 300000, 0, 90, 4030200300089, 5, 'Phá Kích Thạch Hoàn ', 0, 2.50, 72, 54),
	(90, 0, 1, 0, 4030200300090, 6, 'Phá Kích Thạch Tụ Li', 0, 3.00, 72, 60),
	(91, 100000, 0, 0, 4030200300091, 1, 'Kháng Loạn Thạch Ám ', 92, 0.20, 44, 3),
	(92, 150000, 0, 0, 4030200300092, 2, 'Kháng Loạn Thạch Liệ', 93, 0.50, 44, 10),
	(93, 200000, 0, 0, 4030200300093, 3, 'Kháng Loạn Thạch Thư', 94, 0.74, 44, 18),
	(94, 250000, 0, 0, 4030200300094, 4, 'Kháng Loạn Thạch Lấp', 95, 1.40, 44, 31),
	(95, 300000, 0, 96, 4030200300095, 5, 'Kháng Loạn Thạch Hoà', 0, 2.00, 44, 54),
	(96, 0, 1, 0, 4030200300096, 6, 'Kháng Loạn Thạch Tụ ', 0, 2.25, 44, 60),
	(97, 100000, 0, 0, 4030200300097, 1, 'Kháng Choáng Thạch Á', 98, 0.20, 43, 3),
	(98, 150000, 0, 0, 4030200300098, 2, 'Kháng Choáng Thạch L', 99, 0.50, 43, 10),
	(99, 200000, 0, 0, 4030200300099, 3, 'Kháng Choáng Thạch T', 100, 0.74, 43, 18),
	(100, 250000, 0, 0, 4030200300100, 4, 'Kháng Choáng Thạch L', 101, 1.40, 43, 31),
	(101, 300000, 0, 102, 4030200300101, 5, 'Kháng Choáng Thạch H', 0, 2.00, 43, 54),
	(102, 0, 1, 0, 4030200300102, 6, 'Kháng Choáng Thạch T', 0, 2.25, 43, 60),
	(103, 100000, 0, 0, 4030200300103, 1, 'Kháng Độc Thạch Ám V', 104, 0.20, 46, 3),
	(104, 150000, 0, 0, 4030200300104, 2, 'Kháng Độc Thạch Liệt', 105, 0.50, 46, 10),
	(105, 200000, 0, 0, 4030200300105, 3, 'Kháng Độc Thạch Thườ', 106, 0.74, 46, 18),
	(106, 250000, 0, 0, 4030200300106, 4, 'Kháng Độc Thạch Lấp ', 107, 1.40, 46, 31),
	(107, 300000, 0, 108, 4030200300107, 5, 'Kháng Độc Thạch Hoàn', 0, 2.00, 46, 54),
	(108, 0, 1, 0, 4030200300108, 6, 'Kháng Độc Thạch Tụ L', 0, 2.25, 46, 60),
	(109, 100000, 0, 0, 4030200300109, 1, 'Kháng Mê Thạch Ám Vi', 110, 0.20, 45, 3),
	(110, 150000, 0, 0, 4030200300110, 2, 'Kháng Mê Thạch Liệt ', 111, 0.50, 45, 10),
	(111, 200000, 0, 0, 4030200300111, 3, 'Kháng Mê Thạch Thườn', 112, 0.74, 45, 18),
	(112, 250000, 0, 0, 4030200300112, 4, 'Kháng Mê Thạch Lấp L', 113, 1.40, 45, 31),
	(113, 300000, 0, 114, 4030200300113, 5, 'Kháng Mê Thạch Hoàn ', 0, 2.00, 45, 54),
	(114, 0, 1, 0, 4030200300114, 6, 'Kháng Mê Thạch Tụ Li', 0, 2.25, 45, 60),
	(115, 100000, 0, 0, 4030200300115, 1, 'Loạn Xác Thạch Ám Vi', 116, 0.20, 52, 3),
	(116, 150000, 0, 0, 4030200300116, 2, 'Loạn Xác Thạch Liệt ', 117, 0.50, 52, 10),
	(117, 200000, 0, 0, 4030200300117, 3, 'Loạn Xác Thạch Thườn', 118, 0.74, 52, 18),
	(118, 250000, 0, 0, 4030200300118, 4, 'Loạn Xác Thạch Lấp L', 119, 1.40, 52, 31),
	(119, 300000, 0, 120, 4030200300119, 5, 'Loạn Xác Thạch Hoàn ', 0, 2.00, 52, 54),
	(120, 0, 1, 0, 4030200300120, 6, 'Loạn Xác Thạch Tụ Li', 0, 2.25, 52, 60),
	(121, 100000, 0, 0, 4030200300121, 1, 'Choáng Xác Thạch Ám ', 122, 0.20, 53, 3),
	(122, 150000, 0, 0, 4030200300122, 2, 'Choáng Xác Thạch Liệ', 123, 0.50, 53, 10),
	(123, 200000, 0, 0, 4030200300123, 3, 'Choáng Xác Thạch Thư', 124, 0.74, 53, 18),
	(124, 250000, 0, 0, 4030200300124, 4, 'Choáng Xác Thạch Lấp', 125, 1.40, 53, 31),
	(125, 300000, 0, 126, 4030200300125, 5, 'Choáng Xác Thạch Hoà', 0, 2.00, 53, 54),
	(126, 0, 1, 0, 4030200300126, 6, 'Choáng Xác Thạch Tụ ', 0, 2.25, 53, 60),
	(127, 100000, 0, 0, 4030200300127, 1, 'Độc Xác Thạch Ám Viê', 128, 0.20, 54, 3),
	(128, 150000, 0, 0, 4030200300128, 2, 'Độc Xác Thạch Liệt K', 129, 0.50, 54, 10),
	(129, 200000, 0, 0, 4030200300129, 3, 'Độc Xác Thạch Thường', 130, 0.74, 54, 18),
	(130, 250000, 0, 0, 4030200300130, 4, 'Độc Xác Thạch Lấp Lá', 131, 1.40, 54, 31),
	(131, 300000, 0, 132, 4030200300131, 5, 'Độc Xác Thạch Hoàn M', 0, 2.00, 54, 54),
	(132, 0, 1, 0, 4030200300132, 6, 'Độc Xác Thạch Tụ Lin', 0, 2.25, 54, 60),
	(2, 150000, 0, 0, 4030200300002, 2, 'Mệnh Thạch Liệt Khai', 3, 800.00, 1, 10),
	(3, 200000, 0, 0, 4030200300003, 3, 'Mệnh Thạch Thường', 4, 2188.00, 1, 18),
	(4, 250000, 0, 0, 4030200300004, 4, 'Mệnh Thạch Lấp Lánh', 5, 3940.00, 1, 31),
	(5, 300000, 0, 6, 4030200300005, 5, 'Mệnh Thạch Hoàn Mỹ', 0, 9375.00, 1, 54),
	(6, 0, 1, 0, 4030200300006, 6, 'Mệnh Thạch Tụ Linh', 0, 10000.00, 1, 60),
	(7, 100000, 0, 0, 4030200300007, 1, 'Pháp Thạch Ám Viêm', 8, 134.00, 2, 3),
	(8, 150000, 0, 0, 4030200300008, 2, 'Pháp Thạch Liệt Khai', 9, 388.00, 2, 10),
	(9, 200000, 0, 0, 4030200300009, 3, 'Pháp Thạch Thường', 10, 1050.00, 2, 18),
	(10, 250000, 0, 0, 4030200300010, 4, 'Pháp Thạch Lấp Lánh', 11, 1925.00, 2, 31),
	(11, 300000, 0, 12, 4030200300011, 5, 'Pháp Thạch Hoàn Mỹ', 0, 4500.00, 2, 54),
	(13, 100000, 0, 0, 4030200300013, 1, 'Lý Công Thạch Ám Viê', 14, 75.00, 4, 3),
	(12, 0, 1, 0, 4030200300012, 6, 'Pháp Thạch Tụ Linh', 0, 5000.00, 2, 60);


--
-- PostgreSQL database dump complete
--

-- \unrestrict N6V3claB3oafq3dEIVQlvNqCbdOLvf0oiiaYLZnclWNXwXWPcuy3fwd7hbJiMRD


SET session_replication_role = origin;
