SET session_replication_role = replica;

--
-- PostgreSQL database dump
--

-- \restrict h3m50k8Ly06LSXB7TfJCIsY0BPldmWxoE2sVZH3W7En46zCVrhMsjwlGGD55ITO

-- Dumped from database version 17.6
-- Dumped by pg_dump version 17.6

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: data_tbl_prs_show; Type: TABLE DATA; Schema: data; Owner: -
--

INSERT INTO "data"."data_tbl_prs_show" ("id", "limit_time", "limit_type", "name", "need_chip_id", "need_num", "p_n1", "p_n2", "p_n3", "p_n4", "p_n5", "p_n6", "p_n7", "p_n8", "p_t1", "p_t2", "p_t3", "p_t4", "p_t5", "p_t6", "p_t7", "p_t8", "position", "res_code", "tab") VALUES
	(1, 0, 0, 'Nữ Thần Âm Nhạc Rust', 1, 10, 1800, 450, 360, 1440, 1440, 180, 40, 40, 1, 4, 5, 6, 7, 11, 13, 31, 1, 2060100001245, 0),
	(2, 0, 0, 'Nữ Thần Ánh Trăng El', 2, 10, 100, 80, 80, 80, 80, 50, 50, 0, 34, 59, 60, 62, 63, 14, 61, 0, 2, 2060100001247, 0),
	(3, 0, 0, 'Nữ Thần Tự Do Dios', 3, 10, 2880, 720, 576, 2304, 2304, 288, 64, 64, 1, 4, 5, 6, 7, 11, 13, 31, 3, 2060100001238, 0),
	(4, 0, 0, 'Nữ Thần Hỏa Diệm Sid', 4, 10, 160, 128, 128, 128, 128, 80, 80, 0, 34, 59, 60, 62, 63, 14, 61, 0, 4, 2060100001239, 0),
	(5, 0, 0, 'Nữ Thần Chiến Binh L', 5, 10, 3600, 900, 720, 2880, 2880, 360, 80, 80, 1, 4, 5, 6, 7, 11, 13, 31, 5, 2060100001244, 0),
	(6, 0, 0, 'Nữ Thần Hòa Bình Sha', 6, 10, 200, 160, 160, 160, 160, 100, 100, 0, 34, 59, 60, 62, 63, 14, 61, 0, 6, 2060100001246, 0),
	(7, 0, 0, 'Nữ Thần Tình Yêu Sei', 7, 10, 4320, 1080, 864, 3456, 3456, 432, 96, 96, 1, 4, 5, 6, 7, 11, 13, 31, 7, 2060100001243, 0),
	(8, 0, 0, 'Nữ Thần Thánh Khiết ', 8, 10, 240, 192, 192, 192, 192, 120, 120, 0, 34, 59, 60, 62, 63, 14, 61, 0, 8, 2060100001242, 0),
	(9, 0, 0, 'Nữ Thần Tư Pháp Cher', 9, 10, 5400, 1350, 1080, 4320, 4320, 540, 120, 120, 1, 4, 5, 6, 7, 11, 13, 31, 9, 2060100001241, 0),
	(10, 0, 0, 'Thần Hậu Gabriel', 10, 10, 300, 240, 240, 240, 240, 150, 150, 0, 34, 59, 60, 62, 63, 14, 61, 0, 10, 2060100001240, 0),
	(12, 21600, 1, 'Thỏ Peter', 5304, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 2, 2060100001249, 1),
	(11, 10080, 1, 'Người Rơm Vui Vẻ', 5303, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 1, 2060100001248, 1),
	(13, 21600, 1, 'Kagemusha', 5305, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 3, 2060100001250, 1),
	(14, 21600, 1, 'Ngự Lâm Thiết Vệ', 5342, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 4, 2060100001251, 1),
	(15, 43200, 1, 'Pasar Phi Vũ', 5351, 30, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 5, 2060100001252, 1),
	(16, 21600, 1, 'Cute Lạc Lối', 6187, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 6, 2060100001271, 1),
	(18, 10080, 1, 'Himegami Aisa', 6196, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 8, 2060100001272, 1),
	(17, 10080, 1, 'Cute Lạc Lối', 6201, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 7, 2060100001271, 1),
	(19, 21600, 1, 'Himegami Aisa (15 Ng', 6295, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 9, 2060100001272, 1),
	(20, 10080, 1, 'Thumbelina', 6527, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 10, 2060100001273, 1),
	(21, 10080, 1, 'Tinh Thần', 6528, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 11, 2060100001274, 1),
	(22, 21600, 1, 'Thumbelina (15 Ngày)', 6980, 1, 8400, 1850, 1580, 5920, 5920, 740, 150, 150, 1, 4, 5, 6, 7, 11, 13, 31, 10, 2060100001273, 1);


--
-- PostgreSQL database dump complete
--

-- \unrestrict h3m50k8Ly06LSXB7TfJCIsY0BPldmWxoE2sVZH3W7En46zCVrhMsjwlGGD55ITO


SET session_replication_role = origin;
